var app = require('express')();
var http = require('http').Server(app);
var io = require('socket.io')(http);
var path = require('path');
 
// Initialize appication with route / (that means root of the application)
app.get('/', function(req, res){
  var express = require('express');
  app.use(express.static(path.join(__dirname)));
  res.sendFile(path.join(__dirname, 'index.html'));
});


var painter;
var users = [];

var words = ["сантехник","сурдопереводчик","крупье","пожарный","дальнобойщик","психиатр","лифтер","прокурор","акушерка","скульптор","режиссер","кинолог","космонавт","инкассатор","дипломат","крановщик", "химик", "стюардесса", "мерчандайзер", "шахтер", "гинеколог", "пчеловод", "дизайнер", "электрик", "дрессировщик", "промоутер", "археолог", "ветеринар", "дровосек",
  "хамелеон", "ротвейлер", "краб", "жук-навозник", "выхухоль", "морская звезда", "удав", "скунс", "саранча", "страус", "ленивец", "чихуахуа", "блоха", "енот-полоскун", "креветка", "божья коровка", "муравьед", "утконос", "колибри", "бобр", "пеликан", "павлин", "гусеница", "паук", "динозавр", "медуза", "улитка", "индюк", "дикобраз", "шиншилла",
  "подложить свинью", "как с гуся вода", "коту под хвост", "медвежья услуга", "заморить червячка", "когда рак на горе свистнет", "курам на смех", "волк в овечьей шкуре", "наступить на те же грабли", "кот в мешке", "не в своей тарелке", "скатертью дорога", "божий одуванчик", "красота требует жертв", "не разлей вода", "выносить сор из избы", "медведь на ухо наступи",
  "априори", "парадигма", "менталитет", "конъюнктура", "цивилизация", "перспектива", "резонанс", "империя", "эклектика", "аллегория", "концепция", "постоянство", "ресурс", "антураж", "латентность", "индустриализация", "кредо", "плюрализм", "судьба", "контекст", "конфигурация", "инфраструктура", "ассимиляция", "протеже", "коммунизм", "дежавю", "консерватизм", "волюнтаризм",
  "Пока все дома", "Угадай мелодию", "Форт Боярд", "В мире животных", "Последний герой", "Поле чудес", "Дом-2", "Человек и закон", "Сам себе режиссер", "Модный приговор", "Comedy Club", "Звёзды на льду", "Давай поженимся", "Минута славы", "Ты не поверишь", "Пусть говорят", "Малахов +", "Аншлаг", "Наша Russia", "Большая разница", "Умники и умницы", "Что? Где? Когда?",
  "Владимир Жириновский", "Мэрилин Мэнсон", "Никита Михалков", "Стас Михайлов", "Наполеон Бонапарт", "Леди Гага", "Элтон Джон", "Юрий Куклачев", "Майкл Джексон", "Юрий Гагарин", "Исаак Ньютон", "Ксения Собчак", "Джеки Чан", "Андрей Малахов", "Альберт Эйнштейн", "Алина Кабаева", "Иван Грозный", "Павел Воля", "Максим Галкин", "Верка Сердючка",
  "McDonald’s", "Apple", "Google", "Pampers", "Barbie", "Windows", "LEGO", "Ferrari", "Durex", "Bounty", "Twitter", "Gallina Blanca", "M&M’s", "Whiskas", "Playboy", "Chanel №5", "ВКонтакте", "Oriflame", "Ikea", "Duracell", "Jack Daniel’s", "Burn", "Sprite", "Pedigree", "Nokia", "Raffaello", "Love Is", "Harley-Davidson", "Chupa Chups", "YouTube",
  "ихтиандр", "чукча", "Чак Норрис", "кентавр", "гейша", "Терминатор", "Cтарик Хоттабыч", "гопник", "трансвестит", "Муха-Цокотуха", "Котопес", "Бэтмен", "бомж", "Баба-Яга", "Шрэк", "инопланетянин", "Супермен", "Гомер Симпсон", "мачо", "хоббит", "доктор Хаус", "светская львица", "Джек-Воробей", "русалка", "девушка по вызову", "Винни-Пух", "Фредди Крюгер", "гном", "Колобок", "домовой",
  "твистер", "дайвинг", "буккроссинг", "бодиарт", "паркур", "шоппинг", "пейнтбол", "серфинг", "настольный хоккей", "зорбинг", "поход", "брейк-данс", "оригами", "кроссворд", "покер", "танец живота", "экскурсия", "граффити", "цветоводство", "бумеранг", "кладоискательство", "роупджампинг", "КВН", "театр", "автостоп", "скалолазание", "Мафия", "бильярд", "опера", "Фотошоп",
  "Миллион алых роз", "Люби меня по-французски", "Нас не догонят", "В лесу родилась елочка", "Ветер с моря дул", "Мама Люба", "Ах", "эта свадьба", "Земля в иллюминаторе", "Катюша", "Напилася я пьяна", "18 мне уже", "Пусть всегда будет солнце", "Вахтерам", "Белая стрекоза любви", "Вою на луну", "Голая", "Полковнику никто не пишет", "Дельфин и русалка",
  "Аватар", "Человек-паук", "Американский пирог", "О чем говорят мужчины", "Интерны", "Один дома", "Симпсоны", "Кавказская пленница", "Стиляги", "Секс в большом городе", "Мадагаскар", "Кин-дза-дза", "Хатико", "Моя прекрасная няня", "Очень страшное кино", "Маша и медведь", "Мистер и миссис Смит", "Матрица", "Секс по дружбе", "Ну, погоди!"]

var current_word;

io.on('connection', function(socket){
  socket.on('enterRoom', function(user){
    users.push(user);
    if (users.length == 1){
      painter = users[getRandomInt(0,users.length-1)];
      console.log("User " + painter + " is painter.");
      io.emit('painterChoosed', painter);
      current_word = words[getRandomInt(0, words.length-1)];
    }
  });
  socket.on('getWord', function(){
    io.emit('getWord', current_word);
  });
  socket.on('clearCanvas', function(from){
    if (from == painter)
      io.emit('clearCanvas', from);
  });
  socket.on('chatMessage', function(from, msg){
    console.log('chatMessage')
    io.emit('chatMessage', from, msg);
    if (msg == current_word){
      painter = from;
      current_word = words[getRandomInt(0,words.length-1)];
      io.emit('painterChoosed', painter);
    }
  });
  socket.on('showImage', function(from, action){
    io.emit('showImage', from, action);
  });
  socket.on('notifyUser', function(user){
    io.emit('notifyUser', user);
  });
});

// Listen application request on port 3000
http.listen(3000, function(){
  console.log('listening on *:3000');
});

function getRandomInt(min, max)
{
  return Math.floor(Math.random() * (max - min + 1)) + min;
}